/*
从键盘输入一个整数（1~20）
则以该数字为矩阵的大小，把1,2,3...n*n 的数字按照顺时针螺旋的形式填入其中。例如：
  输入数字2，则程序输出：
1 2
4 3
  输入数字3，则程序输出：
1 2 3
8 9 4
7 6 5
  输入数字4，则程序输出：
1   2   3  4
12 13  14  5
11 16  15  6
10  9   8  7

--------------------------------------------------------------------------------
大前提条件（即在此条件下解题）

解题所涉及的知识：结构、数组、指针、标准输入输出、文件操作（只是说最多只会涉及到这么多，此题不一定全部涉及到）

允许使用ANSI C++特性。允许使用STL类库。



（不允许使用MFC类库，ATL类库）

*/
#include<stdio.h>
#include<stdlib.h>
int main()
{
    int n,i,j,t,k=1;
    int str[21][21]= {0};
    scanf("%d",&n);
    for(i=1; i<=n; i++)
        for(j=1; j<=n; j++)
            str[i][j]=-1;
    i=1;
    j=1;
    for(t=1; t<=n*n; t++)
    {
        if(k==1)
        {
            if(str[i][j]==-1)
                str[i][j++]=t;
            else
            {
                k=2;
                i++;
                j--;
            }
        }
        if(k==2)
        {
            if(str[i][j]==-1)
                str[i++][j]=t;
            else
            {
                k=3;
                i--;
                j--;
            }
        }
        if(k==3)
        {
            if(str[i][j]==-1)
                str[i][j--]=t;
            else
            {
                k=4;
                i--;
                j++;
            }
        }
        if(k==4)
        {
            if(str[i][j]==-1)
                str[i--][j]=t;
            else
            {
                k=1;
                i++;
                j++;
                t--;
            }
        }
    }
    for(i=1; i<=n; i++)
    {
        for(j=1; j<=n; j++)
            printf("%-4d",str[i][j]);
        printf("\n");
    }
    system("pause");
    return 0;
}
